<a href="https://colab.research.google.com/github/ninivehelen/Analise_De_Dados/blob/master/C%C3%B3pia_de_Berkeley.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [12]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [13]:
import pandas as pd

In [14]:
dados = pd.read_csv("/content/drive/MyDrive/Berkeley.csv")

In [27]:
dados.head(100)

       Admit  Gender Dept  Freq
0   Admitted    Male    A   512
1   Rejected    Male    A   313
2   Admitted  Female    A    89
3   Rejected  Female    A    19
4   Admitted    Male    B   353
5   Rejected    Male    B   207
6   Admitted  Female    B    17
7   Rejected  Female    B     8
8   Admitted    Male    C   120
9   Rejected    Male    C   205
10  Admitted  Female    C   202
11  Rejected  Female    C   391
12  Admitted    Male    D   138
13  Rejected    Male    D   279
14  Admitted  Female    D   131
15  Rejected  Female    D   244
16  Admitted    Male    E    53
17  Rejected    Male    E   138
18  Admitted  Female    E    94
19  Rejected  Female    E   299
20  Admitted    Male    F    22
21  Rejected    Male    F   351
22  Admitted  Female    F    24
23  Rejected  Female    F   317

In [32]:
dados_departaento_Male = dados[dados["Gender"] == 'Male']

In [36]:
dados_departaento_Male_Admit = dados_departaento_Male[dados_departaento_Male["Admit"] == 'Admitted']

In [39]:
dados_departaento_Male_Admit.head(10)

       Admit Gender Dept  Freq
0   Admitted   Male    A   512
4   Admitted   Male    B   353
8   Admitted   Male    C   120
12  Admitted   Male    D   138
16  Admitted   Male    E    53
20  Admitted   Male    F    22

In [41]:
dados_departaento_Male_Admit["Freq"].sum()

1198

In [43]:
dados_departaento_Female = dados[dados["Gender"] == 'Female']

In [44]:
dados_departaento_Female_Admit = dados_departaento_Female[dados_departaento_Female["Admit"] == 'Admitted']

In [45]:
dados_departaento_Female_Admit.head(10)

       Admit  Gender Dept  Freq
2   Admitted  Female    A    89
6   Admitted  Female    B    17
10  Admitted  Female    C   202
14  Admitted  Female    D   131
18  Admitted  Female    E    94
22  Admitted  Female    F    24

In [47]:
dados_departaento_Female_Admit["Freq"].sum()

557

In [62]:
inscritos_Male_Admit = [825,560,325,417,191,373]

In [ ]:
dados_departaento_Male_Admit['Inscritos'] = inscritos_Male_Admit

In [65]:
dados_departaento_Male_Admit.head(7)

       Admit Gender Dept  Freq  Inscritos
0   Admitted   Male    A   512        825
4   Admitted   Male    B   353        560
8   Admitted   Male    C   120        325
12  Admitted   Male    D   138        417
16  Admitted   Male    E    53        191
20  Admitted   Male    F    22        373

In [58]:
inscritos_Female_Admit = [108,25,593,375,593,341]

In [ ]:
dados_departaento_Female_Admit['Inscritos'] = inscritos_Female_Admit

In [61]:
dados_departaento_Female_Admit.head(7)

       Admit  Gender Dept  Freq  Inscritos
2   Admitted  Female    A    89        108
6   Admitted  Female    B    17         25
10  Admitted  Female    C   202        593
14  Admitted  Female    D   131        375
18  Admitted  Female    E    94        593
22  Admitted  Female    F    24        341

In [74]:
dados3 = pd.concat([dados_departaento_Male_Admit, dados_departaento_Female_Admit])

In [75]:
dados3.head(15)

       Admit  Gender Dept  Freq  Inscritos
0   Admitted    Male    A   512        825
4   Admitted    Male    B   353        560
8   Admitted    Male    C   120        325
12  Admitted    Male    D   138        417
16  Admitted    Male    E    53        191
20  Admitted    Male    F    22        373
2   Admitted  Female    A    89        108
6   Admitted  Female    B    17         25
10  Admitted  Female    C   202        593
14  Admitted  Female    D   131        375
18  Admitted  Female    E    94        593
22  Admitted  Female    F    24        341